# Python with AWS and MONGODB(using pymongo as driver)

### Reading the csv file from aws (s3) to mongodb cloud

In [1]:
#install pymongo
#install dnspython
!pip install pymongo
!pip install dnspython

Requirement already satisfied: pymongo in /home/ec2-user/anaconda3/envs/mxnet_latest_p37/lib/python3.7/site-packages (4.2.0)
Requirement already satisfied: dnspython in /home/ec2-user/anaconda3/envs/mxnet_latest_p37/lib/python3.7/site-packages (2.2.1)

In [2]:
import pymongo

In [3]:
#connect to our mongo database on our atlas server

myclient = pymongo.MongoClient("mongodb+srv://esivw1eo:Family2020@cluster0.wxcci.mongodb.net/myFirstDatabase?retryWrites=true&w=majority")

In [4]:
#look at database names
print(myclient.list_database_names())

['admin', 'local']

In [5]:
#creating or accessing a database
mydb = myclient["mydatabase"]

#make a collection called airline_data 
#remember the collection is loosely equivalent
#to a sql table
mycol = mydb["airline_data"]

In [6]:
import codecs
import csv
import boto3
from collections import Counter

client = boto3.client("s3")

data = client.get_object(Bucket='686springbucket-emmanuel', Key='airline data/airline-safety.csv')


#[{'first_name':'Lisa'},{'first_name':'Pravalika'}]
lsData = []
##the key is going to be the airline name and the value is the sum of incidents_85_99 + fatal_accidents_85_99
reader = csv.DictReader(codecs.getreader("utf-8")(data["Body"]))

for row in csv.DictReader(codecs.getreader("utf-8")(data["Body"])):
    #example of casting avail_seat_km_per_week to int before saving back to dictionary
    row['avail_seat_km_per_week'] = int(row['avail_seat_km_per_week'])
    row['fatal_accidents_85_99'] = int(row['fatal_accidents_85_99'])
    lsData.append(row)

In [7]:
lsData[0]

OrderedDict([('airline', 'Aer Lingus'),
             ('avail_seat_km_per_week', 320906734),
             ('incidents_85_99', '2'),
             ('fatal_accidents_85_99', 0),
             ('fatalities_85_99', '0'),
             ('incidents_00_14', '0'),
             ('fatal_accidents_00_14', '0'),
             ('fatalities_00_14', '0')])

In [8]:
i = 1
while i <= len(lsData):
    for r in lsData:
        r['_id'] = i
        i += 1

In [9]:
#insert "documents" aka dictionaries into the airline_data collection
lsIDS = mycol.insert_many(lsData)

In [10]:
print(lsIDS)

<pymongo.results.InsertManyResult object at 0x7fdda9b102d0>

### Queries done on the Mongodb collection

In [11]:
#just get the first row
x = mycol.find_one()

print(x)

{'_id': 1, 'airline': 'Aer Lingus', 'avail_seat_km_per_week': 320906734, 'incidents_85_99': '2', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}

In [12]:
mydoc1 = mycol.count_documents({})
print("The number of documents in collection : ", mydoc1)

The number of documents in collection :  56

In [13]:
myquery1 = {"_id": {"$in": [35, 55]}}

mydoc2 = mycol.find(myquery1)

for x in mydoc2:
    print(x)

{'_id': 35, 'airline': 'Malaysia Airlines', 'avail_seat_km_per_week': 1039171244, 'incidents_85_99': '3', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '34', 'incidents_00_14': '3', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '537'}
{'_id': 55, 'airline': 'Virgin Atlantic', 'avail_seat_km_per_week': 1005248585, 'incidents_85_99': '1', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}

In [14]:
myquery2 = {"airline": {"$regex": "^B"}}

mydoc3 = mycol.find(myquery2)

for x in mydoc3:
    print(x)

{'_id': 15, 'airline': 'British Airways*', 'avail_seat_km_per_week': 3179760952, 'incidents_85_99': '4', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '6', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}

In [15]:
myquery3 = { "airline": "COPA" }

mydoc4 = mycol.find(myquery3)

for x in mydoc4:
    print(x)

{'_id': 19, 'airline': 'COPA', 'avail_seat_km_per_week': 550491507, 'incidents_85_99': '3', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '47', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}

The Next query is for **fatal_accidents_85_99** that are exactly "14".
**Note**: Although this is a number it is seen as a string, so the value is embedded in quotes, this is so because it was not casted to integer as we did with **avail_seat_km_per_week** above.

In [16]:
myquery4 = {"fatal_accidents_85_99":14}
mydoc5 = mycol.find(myquery4)

for x in mydoc5:
    print(x)

{'_id': 2, 'airline': 'Aeroflot*', 'avail_seat_km_per_week': 1197672318, 'incidents_85_99': '76', 'fatal_accidents_85_99': 14, 'fatalities_85_99': '128', 'incidents_00_14': '6', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '88'}

The 5th query is for **avail_seat_km_per_week** with a value greater than **500,000,000** and since this has been casted to integer, the value is placed without any embedded quotes. Also **$gt** is used to specify values greater than **500,000,000**. Finally I then sorted based on values of **avail_seat_km_per_week** in ascending order.

In [17]:
myquery5 = {"avail_seat_km_per_week":{"$gt":500000000}}
mydoc6 = mycol.find(myquery5).sort("avail_seat_km_per_week")

for x in mydoc6:
    print(x)

{'_id': 24, 'airline': 'Finnair', 'avail_seat_km_per_week': 506464950, 'incidents_85_99': '1', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 19, 'airline': 'COPA', 'avail_seat_km_per_week': 550491507, 'incidents_85_99': '3', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '47', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 21, 'airline': 'Egyptair', 'avail_seat_km_per_week': 557699891, 'incidents_85_99': '8', 'fatal_accidents_85_99': 3, 'fatalities_85_99': '282', 'incidents_00_14': '4', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '14'}
{'_id': 4, 'airline': 'Aeromexico*', 'avail_seat_km_per_week': 596871813, 'incidents_85_99': '3', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '64', 'incidents_00_14': '5', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 25, 'airline': 'Garuda Indonesia', 'avail_seat_km_per_week': 613356665, 'incidents_85_99': '10', 'fatal_accidents_85_99': 3, 'fatalities_85_99': '260', 'incidents_00_14': '4', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '22'}
{'_id': 49, 'airline': 'TAP - Air Portugal', 'avail_seat_km_per_week': 619130754, 'incidents_85_99': '0', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 54, 'airline': 'Vietnam Airlines', 'avail_seat_km_per_week': 625084918, 'incidents_85_99': '7', 'fatal_accidents_85_99': 3, 'fatalities_85_99': '171', 'incidents_00_14': '1', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 43, 'airline': 'South African', 'avail_seat_km_per_week': 651502442, 'incidents_85_99': '2', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '159', 'incidents_00_14': '1', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 40, 'airline': 'SAS*', 'avail_seat_km_per_week': 682971852, 'incidents_85_99': '5', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '6', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '110'}
{'_id': 10, 'airline': 'Alitalia', 'avail_seat_km_per_week': 698012498, 'incidents_85_99': '7', 'fatal_accidents_85_99': 2, 'fatalities_85_99': '50', 'incidents_00_14': '4', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 8, 'airline': 'Air New Zealand*', 'avail_seat_km_per_week': 710174817, 'incidents_85_99': '3', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '5', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '7'}
{'_id': 46, 'airline': 'SWISS*', 'avail_seat_km_per_week': 792601299, 'incidents_85_99': '2', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '229', 'incidents_00_14': '3', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 17, 'airline': 'China Airlines', 'avail_seat_km_per_week': 813216487, 'incidents_85_99': '12', 'fatal_accidents_85_99': 6, 'fatalities_85_99': '535', 'incidents_00_14': '2', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '225'}
{'_id': 41, 'airline': 'Saudi Arabian', 'avail_seat_km_per_week': 859673901, 'incidents_85_99': '7', 'fatal_accidents_85_99': 2, 'fatalities_85_99': '313', 'incidents_00_14': '11', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 7, 'airline': 'Air India*', 'avail_seat_km_per_week': 869253552, 'incidents_85_99': '2', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '329', 'incidents_00_14': '4', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '158'}
{'_id': 9, 'airline': 'Alaska Airlines*', 'avail_seat_km_per_week': 965346773, 'incidents_85_99': '5', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '5', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '88'}
{'_id': 33, 'airline': 'LAN Airlines', 'avail_seat_km_per_week': 1001965891, 'incidents_85_99': '3', 'fatal_accidents_85_99': 2, 'fatalities_85_99': '21', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 55, 'airline': 'Virgin Atlantic', 'avail_seat_km_per_week': 1005248585, 'incidents_85_99': '1', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 35, 'airline': 'Malaysia Airlines', 'avail_seat_km_per_week': 1039171244, 'incidents_85_99': '3', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '34', 'incidents_00_14': '3', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '537'}
{'_id': 28, 'airline': 'Iberia', 'avail_seat_km_per_week': 1173203126, 'incidents_85_99': '4', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '148', 'incidents_00_14': '5', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 2, 'airline': 'Aeroflot*', 'avail_seat_km_per_week': 1197672318, 'incidents_85_99': '76', 'fatal_accidents_85_99': 14, 'fatalities_85_99': '128', 'incidents_00_14': '6', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '88'}
{'_id': 48, 'airline': 'TAM', 'avail_seat_km_per_week': 1509195646, 'incidents_85_99': '8', 'fatal_accidents_85_99': 3, 'fatalities_85_99': '98', 'incidents_00_14': '7', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '188'}
{'_id': 29, 'airline': 'Japan Airlines', 'avail_seat_km_per_week': 1574217531, 'incidents_85_99': '3', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '520', 'incidents_00_14': '0', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 50, 'airline': 'Thai Airways', 'avail_seat_km_per_week': 1702802250, 'incidents_85_99': '8', 'fatal_accidents_85_99': 4, 'fatalities_85_99': '308', 'incidents_00_14': '2', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '1'}
{'_id': 32, 'airline': 'Korean Air', 'avail_seat_km_per_week': 1734522605, 'incidents_85_99': '12', 'fatal_accidents_85_99': 5, 'fatalities_85_99': '425', 'incidents_00_14': '1', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 11, 'airline': 'All Nippon Airways', 'avail_seat_km_per_week': 1841234177, 'incidents_85_99': '3', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '1', 'incidents_00_14': '7', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 5, 'airline': 'Air Canada', 'avail_seat_km_per_week': 1865253802, 'incidents_85_99': '2', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '2', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 31, 'airline': 'KLM*', 'avail_seat_km_per_week': 1874561773, 'incidents_85_99': '7', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '3', 'incidents_00_14': '1', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 38, 'airline': 'Qantas*', 'avail_seat_km_per_week': 1917428984, 'incidents_85_99': '1', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '5', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 51, 'airline': 'Turkish Airlines', 'avail_seat_km_per_week': 1946098294, 'incidents_85_99': '8', 'fatal_accidents_85_99': 3, 'fatalities_85_99': '64', 'incidents_00_14': '8', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '84'}
{'_id': 42, 'airline': 'Singapore Airlines', 'avail_seat_km_per_week': 2376857805, 'incidents_85_99': '2', 'fatal_accidents_85_99': 2, 'fatalities_85_99': '6', 'incidents_00_14': '2', 'fatal_accidents_00_14': '1', 'fatalities_00_14': '83'}
{'_id': 53, 'airline': 'US Airways / America West*', 'avail_seat_km_per_week': 2455687887, 'incidents_85_99': '16', 'fatal_accidents_85_99': 7, 'fatalities_85_99': '224', 'incidents_00_14': '11', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '23'}
{'_id': 16, 'airline': 'Cathay Pacific*', 'avail_seat_km_per_week': 2582459303, 'incidents_85_99': '0', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '2', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 6, 'airline': 'Air France', 'avail_seat_km_per_week': 3004002661, 'incidents_85_99': '14', 'fatal_accidents_85_99': 4, 'fatalities_85_99': '79', 'incidents_00_14': '6', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '337'}
{'_id': 15, 'airline': 'British Airways*', 'avail_seat_km_per_week': 3179760952, 'incidents_85_99': '4', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '6', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 44, 'airline': 'Southwest Airlines', 'avail_seat_km_per_week': 3276525770, 'incidents_85_99': '1', 'fatal_accidents_85_99': 0, 'fatalities_85_99': '0', 'incidents_00_14': '8', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 34, 'airline': 'Lufthansa*', 'avail_seat_km_per_week': 3426529504, 'incidents_85_99': '6', 'fatal_accidents_85_99': 1, 'fatalities_85_99': '2', 'incidents_00_14': '3', 'fatal_accidents_00_14': '0', 'fatalities_00_14': '0'}
{'_id': 12, 'airline': 'American*', 'avail_seat_km_per_week': 5228357340, 'incidents_85_99': '21', 'fatal_accidents_85_99': 5, 'fatalities_85_99': '101', 'incidents_00_14': '17', 'fatal_accidents_00_14': '3', 'fatalities_00_14': '416'}
{'_id': 20, 'airline': 'Delta / Northwest*', 'avail_seat_km_per_week': 6525658894, 'incidents_85_99': '24', 'fatal_accidents_85_99': 12, 'fatalities_85_99': '407', 'incidents_00_14': '24', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '51'}
{'_id': 52, 'airline': 'United / Continental*', 'avail_seat_km_per_week': 7139291291, 'incidents_85_99': '19', 'fatal_accidents_85_99': 8, 'fatalities_85_99': '319', 'incidents_00_14': '14', 'fatal_accidents_00_14': '2', 'fatalities_00_14': '109'}

### Converting a MongoDB collection to a pandas dataframe

We have see how we create MongoDB database and store collections directly from a csv file stored in **aws (s3)** using **pymongo** as a mongodb driver now, we would look at how an existing mongodb collection can be converted to a pandas dataframe for data analysis

The first 5 cells of code of the notebook above are still need, that is: install/import necessary modules, connect to the mongodb client, database and collections, then we can continue.

In [18]:
import pandas as pd

In [19]:
df = pd.DataFrame(list(mycol.find()))
df.head(5)

,_id,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
0,1,Aer Lingus,320906734,2,0,0,0,0,0
1,2,Aeroflot*,1197672318,76,14,128,6,1,88
2,3,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,4,Aeromexico*,596871813,3,1,64,5,0,0
4,5,Air Canada,1865253802,2,0,0,2,0,0

Now we have how pandas dataframe, we can now continue using this for any data analysis, but first make sure you convert any necessary column to the qppropriate datatype, you can see the data types of each column using the info() pandas method.

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   _id                     56 non-null     int64
 1   airline                 56 non-null     object
 2   avail_seat_km_per_week  56 non-null     int64
 3   incidents_85_99         56 non-null     object
 4   fatal_accidents_85_99   56 non-null     int64
 5   fatalities_85_99        56 non-null     object
 6   incidents_00_14         56 non-null     object
 7   fatal_accidents_00_14   56 non-null     object
 8   fatalities_00_14        56 non-null     object
dtypes: int64(3), object(6)
memory usage: 4.1+ KB

The new notebook showing data cleaning, analysis and visualization would be available in the data visualization sub-folder of this repo. **cheers**.